function Politka() {
    return (
        <div className="bg-white py-6 sm:py-8 lg:py-10">
            <div
                className="
                 mx-auto
                 w-full
                 px-4
                 py-6
                 sm:px-6 sm:py-8
                 lg:px-8 lg:py-12
                 max-w-[360px]
                 sm:max-w-[786px]
                 lg:max-w-6xl
        "
            >
                <h1
                    className=" font-bold text-gray-900 text-xl sm:text-2xl lg:text-3xl mb-6
          "
                >
                    Политика конфиденциальности
                </h1>

                <div
                    className=" bg-gray-50 rounded-lg text-sm p-4 leading-relaxed sm:p-5 mb-8 lg:p-6 text-gray-800 sm:text-base space-y-4
          "
                >
                    <p>
                        Настоящая Политика конфиденциальности и обработки персональных данных
                        (далее – Политика конфиденциальности) регулирует порядок обработки и
                        использования персональных и иных данных, собранных Товариществом с
                        ограниченной ответственностью «https://Stroiopttorg.ru».
                    </p>

                    <p>
                        Во всех указанных случаях Товарищество обрабатывает персональные данные
                        пользователей исключительно в рамках требований законодательства РФ
                        и международных договоров.
                    </p>
                </div>

                <div
                    className="
            text-gray-800
            text-sm
            sm:text-base
            leading-relaxed
            space-y-10
          "
                >

                    <section>
                        <h2 className="font-semibold text-base sm:text-lg mb-3">
                            1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
                        </h2>

                        <p className="mb-2">
                            В настоящей Политике конфиденциальности используются следующие термины:
                        </p>
                        <ul className="space-y-2">
                            <li><b>1.1.1.</b> Сайт – интернет-ресурс, расположенный в сети Интернет по адресу: https://Stroiopttorg.ru. Все исключительные права на Сайт и его отдельные элементы (включая программное обеспечение, дизайн) принадлежат Товариществу в полном объеме.</li>
                            <li><b>1.1.2.</b> Персональные данные — персональные данные Пользователя, которые Пользователь предоставляет самостоятельно при регистрации или в процессе использования функционала Сайта.</li>
                            <li><b>1.1.3.</b> «Пользователь Сайта (далее – Пользователь)» – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт интернет-магазина.</li>
                            <li><b>1.1.4.</b> «Обработка персональных данных» – действие или совокупность действий, совершаемых с использованием средств автоматизации или без использования таких средств, направленные на накопление, хранение, изменение, дополнение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</li>
                            <li><b>1.1.5.</b> «Конфиденциальность персональных данных» – обязательное для соблюдения Товариществом, его работниками или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</li>
                            <li><b>1.1.6.</b> «Cookies» — небольшие текстовые файлы, которые хранят информацию непосредственно на компьютере пользователя, его мобильном телефоне или другом устройстве.</li>
                            <li><b>1.1.7.</b> «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.</li>
                        </ul>
                    </section>

                    <section>
                        <h2 className="font-semibold text-base sm:text-lg mb-3">
                            2. ОБЩИЕ ПОЛОЖЕНИЯ
                        </h2>
                        <ul className="space-y-2">
                            <li><b>2.1.</b> Использование Пользователем Сайта означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</li>
                            <li><b>2.2.</b> В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование Сайта. </li>
                            <li><b>2.3.</b> Настоящая Политика конфиденциальности применяется только к Сайту интернет-магазина «https://Stroiopttorg.ru.com». Товарищество не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте. </li>
                        </ul>
                    </section>

                    <section>
                        <h2 className="font-semibold text-base sm:text-lg mb-3">
                            3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ
                        </h2>
                        <ul className="space-y-2">
                            <li><b>3.1.</b> Настоящая Политика конфиденциальности устанавливает обязательства Товарищества по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет при регистрации на Сайте или при оформлении заказа для приобретения товара. </li>
                            <li><b>3.2.</b>  Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем при оформлении Заказа на Сайте или шоу-руме и включают в себя следующую информацию:</li>
                            <li><b>3.2.1.</b> фамилию, имя и отчество Пользователя; </li>
                            <li><b>3.2.2.</b> контактный телефон Пользователя;</li>
                            <li><b>3.2.3.</b> адрес электронной почты;</li>
                            <li><b>3.2.4.</b> адрес доставки Товара</li>
                            <li><b>3.3.</b>  Сайт защищает данные, которые автоматически передаются в процессе просмотра рекламных блоков и при посещении страниц, на которых установлен статистический скрипт системы (“пиксель”):</li>
                            <ul className="list-disc pl-5 space-y-1">
                                <li>IP адрес;</li>
                                <li>информация из cookies;</li>
                                <li>информация о браузере;</li>
                                <li>время доступа;</li>
                                <li>адрес страницы,  на котором расположен рекламный блок; </li>
                            </ul>
                            <li><b>3.4</b> Сайт осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей. </li>
                            <li><b>3.5</b>Любая иная персональная информация не оговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в пунктах 5.2. и 5.3. Политики конфиденциальности. </li>
                        </ul>
                    </section>

                    <section>
                        <h2 className="font-semibold text-base sm:text-lg mb-3">
                            4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНЫХ ДАННЫХ
                        </h2>
                        <ul className="space-y-2">
                            <li><b>4.1.</b> Персональные данные Пользователя Товарищество может использовать в целях:</li>
                            <li><b>4.1.1.</b> Идентификации Пользователя, зарегистрированного на Сайте, для оформления заказа и (или) заключения Договора купли-продажи товара дистанционным способом на Сайте.</li>
                            <li><b>4.1.2.</b> Предоставления Пользователю доступа к персонализированным ресурсам Сайта.</li>
                            <li><b>4.1.3.</b> Установления с Пользователем обратной связи, включая направление уведомлений, запросов, информационных сообщений, касающихся использования Сайта, оказания услуг, обработки запросов и заявок от Пользователя. </li>
                            <li><b>4.1.4.</b> Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</li>
                            <li><b>4.1.5.</b> Статистических и маркетинговых исследований, с целью в том числе улучшения качества предоставления услуг.</li>
                            <li><b>4.1.6.</b> Создания учетной записи для совершения покупок, если Пользователь дал согласие на создание учетной записи.</li>
                            <li><b>4.1.7.</b> Уведомления Пользователя Сайта о состоянии его заказа, доставки заказа. </li>
                            <li><b>4.1.8.</b> Обработки и получения платежей, определения права на получение скидок, бонусов Пользователем.</li>
                            <li><b>4.1.9.</b> Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных с использованием Сайта. </li>
                            <li><b>4.1.10.</b> Предоставления Пользователю с его согласия, обновлений продукции, специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени Сайта или от имени партнеров Сайта.</li>
                            <li><b>4.1.11.</b>Осуществления рекламной деятельности с согласия Пользователя.</li>
                            <li><b>4.1.12.</b>Предоставления доступа Пользователю на сайты или сервисы партнеров Сайта с целью получения продуктов, обновлений и услуг.</li>
                        </ul>
                    </section>

                    <section>
                        <h2 className="font-semibold text-sm sm:text-base mb-2 sm:mb-3">
                            5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ
                        </h2>
                        <ul className="space-y-2">
                            <li><b>5.1.</b> Обработка персональных данных Пользователя осуществляется без ограничения срока, но не дольше, чем это предусмотрено законодательством Республики Казахстан, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</li>
                            <li><b>5.2.</b> Пользователь соглашается с тем, что Товарищество вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациям почтовой связи, операторам связи, исключительно в целях выполнения заказа Пользователя, оформленного на Сайте, включая доставку Товара </li>
                            <li><b>5.3.</b>Персональные данные Пользователя могут быть переданы по запросу уполномоченных государственных органов Республики Казахстан оформленных в соответствии с требованиями законодательства Республики Казахстан и только по основаниям и в порядке, установленным законодательством РФ.</li>
                            <li><b>5.4.</b>При утрате или разглашении персональных данных, Товарищество информирует Пользователя об утрате или разглашении персональных данных.</li>
                            <li><b>5.5.</b>Товарищество принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, использования, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц. </li>
                            <li><b>5.6.</b>Товарищество принимает все необходимые меры, в том числе правовые, организационные и технические, для предотвращения убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя. </li>
                        </ul>
                    </section>

                    <section>
                        <h2 className="font-semibold text-sm sm:text-base mb-2 sm:mb-3">
                            6. ПРАВА И ОБЯЗАННОСТИ СТОРОН
                        </h2>
                        <ul className="space-y-2">
                            <li><b>6.1.</b> Пользователь обязан:</li>
                            <li><b>6.1.1.</b>Предоставить информацию о персональных данных, необходимую для пользования Сайтом.</li>
                            <li><b>6.1.2.</b> Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.</li>
                            <li><b>6.2.</b> Пользователь вправе:</li>
                            <li><b>6.2.1.</b>Знать о наличии у Товарищества своих персональных данных, а также получать информацию, содержащую подтверждение факта, цели, источников, способов сбора и обработки персональных данных, перечень персональных данных, сроки обработки персональных данных, в том числе сроки их хранения.</li>
                            <li><b>6.2.2.</b> Требовать от Товарищества, а также третьего лица изменения и дополнения своих персональных данных при наличии оснований, подтвержденных соответствующими документами.</li>
                            <li><b>6.2.3.</b> Требовать от Товарищества, а также третьего лица уничтожения своих персональных данных, сбор и обработка которых произведены с нарушением законодательства Республики Казахстан, а также в иных случаях, установленных нормативными правовыми актами Республики Казахстан.</li>
                            <li><b>6.2.4.</b> Защищать свои права и законные интересы, в порядке, установленном законодательством РФ.</li>
                            <li><b>6.3.</b> Товарищество обязано:</li>
                            <li><b>6.3.1.</b> Использовать полученную информацию исключительно для целей, указанных в разделе 4 настоящей Политики конфиденциальности. </li>
                            <li><b>6.3.2.</b> Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением пунктов 5.2. и 5.3. настоящей Политики Конфиденциальности.</li>
                            <li><b>6.3.3.</b> Принимать и соблюдать необходимые меры, в том числе правовые, организационные и технические, для защиты персональных данных в соответствии с законодательством Республики Казахстан.</li>
                            <li><b>6.3.4.</b>Осуществлять блокирование персональных данных, относящихся к соответствующему Пользователю, с момента получения обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, а также в случае выявления недостоверных персональных данных или неправомерных действий третьих лиц.</li>
                            <li><b>6.3.5.</b>Предоставлять по запросу уполномоченного органа в рамках рассмотрения обращений физических и юридических лиц информацию о способах и процедурах, используемых для обеспечения соблюдения Товариществом требований Закона.</li>
                            <li><b>6.3.6.</b> Принимать меры по уничтожению персональных данных в случае достижения цели их сбора и обработки, а также в иных случаях, установленных Законом.</li>
                            <li><b>6.3.7.</b>Соблюдать законодательство Республики Казахстан о персональных данных и их защите.</li>
                            <li><b>6.3.8.</b>Блокировать персональные данные, относящиеся к Пользователю, в случае наличия информации о нарушении условий их сбора, обработки.</li>
                            <li><b>6.3.9.</b> Уничтожить персональные данные в случае подтверждения факта их сбора, обработки с нарушением законодательства Республики Казахстан, а также в иных случаях, установленных Законом.</li>
                            <li><b>6.4.</b>Товарищество вправе:</li>
                            <li><b>6.4.1.</b>6.4. Товарищество вправе:</li>
                        </ul>
                    </section>

                    <section>
                        <h2 className="font-semibold text-sm sm:text-base mb-2 sm:mb-3">
                            7. ОТВЕТСТВЕННОСТЬ СТОРОН
                        </h2>
                        <ul className="space-y-2">
                            <li><b>7.1.</b> Товарищество, не исполнившее свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Республики Казахстан, за исключением случаев, предусмотренных пунктами 5.2., 5.3. и 7.2. Политики конфиденциальности.</li>
                            <li><b>7.2.</b> В случае утраты или разглашения конфиденциальной информации, Товарищество не несёт ответственность, если данная конфиденциальная информация:</li>
                            <li><b>7.2.1.</b> Стала общедоступной, после ее предоставления Товариществу или его работникам, не по вине, действию или бездействию Товарищества.</li>
                            <li><b>7.2.2.</b> Была получена от третьей стороны до момента её получения Товариществом;</li>
                            <li><b>7.2.3.</b> Была разглашена с согласия Пользователя.</li>
                            <li><b>8.</b>РАЗРЕШЕНИЕ СПОРОВ</li>
                            <li><b>8.1.</b>До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Сайта и Товариществом, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора). Все претензии в адрес Товарищества должны быть направлены заказным письмом по юридическому адресу Товарищества, дополнительно претензия может быть направлена на электронный адрес  info@https://Stroiopttorg.ru.</li>
                            <li><b>8.2.</b>Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.</li>
                            <li><b>8.3.</b> При недостижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Республики Казахстан.</li>
                        </ul>
                    </section>

                    <section>
                        <h2 className="font-semibold text-base sm:text-lg mb-3">
                            9. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ
                        </h2>
                        <ul className="space-y-2">
                            <li><b>9.1.</b>К настоящей Политике конфиденциальности и отношениям между Пользователем и Товариществом применяется действующее законодательство Республики Казахстан.</li>
                            <li><b>9.2.</b> Действующая Политика конфиденциальности размещена на в подвале сайта https://Stroiopttorg.ru.</li>
                            <li><b>9.3.</b> Товарищество вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя. Новая редакция Политики конфиденциальности вступает в силу с момента ее размещения в сети Интернет по указанному в пункте 9.2. адресу.</li>
                            <li><b>9.3.</b>. Все предложения или вопросы по настоящей Политике конфиденциальности следует отправлять на адрес электронной почты:  <span className="text-red-500 font-semibold">
                                info@Stroiopttorg.ru
                            </span> </li>
                        </ul>
                    </section>

                </div>
            </div>
        </div>
    );
}

export default Politka;
